package oop8;

public class BookMainClass {

	public static void main(String[] args) {
		/*
		 * 클래스 구조
		 * 	- 전역변수, 멤버변수
		 * 	  지역변수
		 * 	- 생성자
		 * 		-> 초기화
		 * 		-> 매개변수가 있는 생성자, 없는 생성자
		 * 	- 메소드
		 * 		-> 지역변수
		 * 		-> 메소드 작성방법
		 * 		-> 오버로딩 (매개변수 타입, 개수가 다른)
		 * 
		 * 	- 클래스 객체화
		 * 		-> 클래스명 변수명 = new 클래스명();
		 * 							   생성자
		 * 								-> 객체화 시 딱 한번 호출
		 * 								-> 생성자는 초기화 시 사용
		 * 		-> 변수명.메소드명
		 * 		-> 변수명.전역변수명
		 * 			- static : 객체화없이 변수, 메소드를 사용 가능 (클래스명.변수명, 클래스명.메소드명)
		 * 			- final : 상수, 값이 선언과 동시에 초기화
		 * 			- static final : 선언하지 않고 사용하는 상수
		 * 
		 * 	- 접근제어자
		 * 		-> public : 어디서든 사용 가능
		 * 		-> private : 클래스 내에서만 사용 가능
		 * 			- getter, setter (캡슐화
		 */
	}

}
